{
  "formidable": {
    "name": "Formidable",
    "url": "http://www.formidable.com",
    "description": "Formidable is a Seattle-based consultancy and open-source shop, with an emphasis on React.js and Node.js. We consult, augment, and train to level-up teams and solve engineering problems with some of the country's top companies. We help organize popular meet-ups in Seattle, speak at conferences, write books, and are active in the OSS ecosystem, with many popular open-source projects. We are the React Experts, helping to build the modern web.",
    "logo": "/assets/img/sponsors/formidable.svg"
  },
  "strong-loop": {
    "name": "Strong Loop",
    "url": "http://developer.ibm.com/apiconnect",
    "description": "At StrongLoop, an IBM company, we don’t just build products for Node, we help create it. StrongLoop was founded in 2013 by Node and io.js core committers Bert Belder and Ben Noordhuis. StrongLoop now maintains over 130 open source npm modules and sponsors the popular LoopBack and Express frameworks.",
    "logo": "/assets/img/sponsors/strongloop.svg"
  },
  "ibm-design": {
    "name": "IBM Design",
    "url": "http://www.ibm.com/design",
    "description": "IBM is on a mission to create a sustainable culture of design and to bring a human-centered focus to thousands of product and service experiences. IBM Design is the new design organization based in Austin, Texas, where designers, engineers, and business leaders collaborate to help create a new way of working that will impact humanity in ways that matter and endure. When complete, this transformation will make IBM the largest product design organization in the world.",
    "logo": "/assets/img/sponsors/ibm-design.svg"
  },
  "saucelabs": {
    "name": "SauceLabs",
    "url": "https://saucelabs.com",
    "description": "Sauce Labs makes automated testing awesome. Our cloud-based platform helps developers test native & hybrid mobile and web applications across 700+ browser / OS platforms, including iOS, Android & Mac OS X. Sauce supports Selenium, Appium and popular JavaScript unit testing frameworks, and integrates with all of the top programming languages, test frameworks and CI systems. With built-in video recording and screenshots of every test case, debugging tools, and secure tunneling for local or firewalled testing, Sauce makes running, debugging and scaling test suites quick and easy. To get started for free, visit saucelabs.com.",
    "logo": "/assets/img/sponsors/saucelabs.svg"
  },
  "craigslist": {
    "name": "craigslist",
    "url": "http://www.craigslist.org/about/craigslist_is_hiring",
    "description": "craigslist - a place to buy, sell, rent, hire, share, meet, swap, discuss, find, serve, connect, give away, announce, work, collect, care, perform, learn, marvel, mentor, befriend, fall in love, and/or save the world.",
    "logo": "/assets/img/sponsors/craigslist.svg"
  },
  "github": {
    "name": "GitHub",
    "url": "http://github.com",
    "description": "",
    "logo": "/assets/img/sponsors/github.svg"
  },
  "twilio": {
    "name": "Twilio",
    "url": "https://www.twilio.com",
    "description": "Twilio is a cloud communications platform for software developers to build, scale and operate real time communications in their software applications. Twilio powers the future of business communications, enabling phones, VoIP, and messaging to be embedded into web, desktop, and mobile software. We take care of the messy telecom hardware and expose a globally available cloud API that developers can interact with intelligent & complex communications systems.",
    "logo": "/assets/img/sponsors/twilio.svg"
  },
  "rollbar": {
    "name": "Rollbar",
    "url": "https://rollbar.com/",
    "description": "Rollbar’s error monitoring helps developers detect, diagnose and defeat application errors. Quickly pinpoint what’s broken and why. View exceptions from all of your languages, frameworks, platforms and environments in one place. It's easy to install. You can start tracking production errors and deployments in 8 minutes or less. With Rollbar you get a deeper understanding of your errors and exceptions. To get started for free, visit rollbar.com.",
    "logo": "/assets/img/sponsors/rollbar.svg"
  },
  "newrelic": {
    "name": "New Relic",
    "url": "http://www.newrelic.com",
    "description": "New Relic is a software analytics company that makes sense of billions of metrics about millions of applications in real time. Our comprehensive SaaS-based solution provides one powerful interface for web and native mobile applications and consolidates the performance monitoring data for any chosen technology in your environment. Our 90,000 customers use our cloud solution every day to optimize more than 200 billion metrics for 3 million applications. Learn more at newrelic.com.",
    "logo": "/assets/img/sponsors/newrelic.svg"
  },
  "simple": {
    "name": "Simple",
    "url": "http://simple.com",
    "description": "At Simple, doing right by our customers is the heart of our business. Simple customers receive a Simple Visa® debit card that's tied to an FDIC-insured account. This account offers no surprise fees, and provides powerful budgeting and savings tools right in our mobile and online apps. We are headquartered in Portland, OR and support a large group of remote engineers across the US. https://www.simple.com/ Interested in building the future of personal banking with a group of kind, funny, smart people who love music, food, design, coffee, and code, Simple is the place for you. https://www.simple.com/careers",
    "logo": "/assets/img/sponsors/simple.svg"
  },
  "godaddy": {
    "name": "GoDaddy",
    "url": "http://www.godaddy.com",
    "description": "GoDaddy's mission is to radically shift the global economy toward small businesses by empowering people to easily start, confidently grow and successfully run their own ventures. With 14 million customers worldwide and 62 million domain names under management, GoDaddy gives small business owners the tools to name their idea, build a beautiful online presence, attract customers and manage their business. To learn more about the company, visit www.GoDaddy.com. ",
    "logo": "/assets/img/sponsors/godaddy.svg"
  },
  "activestate": {
    "name": "ActiveState",
    "url": "http://komodoide.com/web-ide/?utm_source=cascadiajs16&utm_medium=link&utm_term=&utm_content=text&utm_campaign=cascadiajs16",
    "description": "Komodo IDE by ActiveState is a powerful, full-featured multi-language IDE for Python, PHP, JavaScript, HTML5 and CSS, NodeJS, Golang, Ruby, PhoneGap, Cordova, and a variety of other languages and frameworks. Since 2000, Komodo has been designed with development in mind. Features include syntax checking, smart code and API assistance, code refactoring and code formatting, visual real time debugging, code profiling, regular expression helper, track changes, unit testing, version control system integration and more. Whether for teams or individuals, our flexible licensing options, cross-platform installers, and full feature set make Komodo the best IDE on the market today.",
    "logo": "/assets/img/sponsors/activestate.svg"
  },
  "losant": {
    "name": "Losant",
    "url": "http://www.losant.com",
    "description": " Losant is a cloud IoT platform that enables developers to easily make use of real-time data by rapidly building connected applications for the Internet of Things. Losant makes connecting any hardware simple with open source SDKs for multiple languages and widely adopted communication protocols. Easy-to-use tools and functionality make building real-time reactions and visualizing IoT data a breeze. Losant also exposes an open API that provides developers the option to build on top of the platform with complete access to all the data and functionality found in the front end.",
    "logo": "/assets/img/sponsors/losant.svg"
  }
}